================================================================================
Quilt Expression
================================================================================
1 + 2
--------------------------------------------------------------------------------

(module
  (expression_statement
    (binary_operator
      (integer)
      (integer))))

================================================================================
Quilt Statement
================================================================================
x = y
--------------------------------------------------------------------------------

(module
  (expression_statement
    (assignment
      (identifier)
      (identifier))))

================================================================================
Quilt Hole
================================================================================
_
--------------------------------------------------------------------------------

(module
  (expression_statement
    (quilt_hole)))

================================================================================
Quilt Hole Var
================================================================================
_ = y
--------------------------------------------------------------------------------

(module
  (expression_statement
    (assignment
      (quilt_hole)
      (identifier))))